Revit 2027 API
Alignment Properties
The Alignment type exposes the following members.
Properties
Name | Description
Description |  The Description of this alignment.
DisplayedEndStation |  Specifies the station at which the alignment's display ends, in Revit internal model units (standard Imperial feet).
DisplayedStartStation |  Specifies the station at which the alignment's display starts, in Revit internal model units (standard Imperial feet).
Element |  The underlying DirectShape element.
EndStation |  Specifies the station at which the alignment's geometric definition ends, in Revit internal model units (standard Imperial feet).
GUID |  The GUID of this alignment.
Name |  The Name of this alignment.
StartStation |  Specifies the station at which the alignment's geometric definition starts, in Revit internal model units (standard Imperial feet).
Top
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace